Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: Any transformations applied to the authenticated identity of the SSH client made by the SSH server (e.g., via authentication services or mappings to system accounts) are outside the scope of this document.
ja: SSH サーバで行なわれる SSH クライアントの認証された識別情報に対して適用される変換 (例えば, 認証サービスによるものやシステムアカウントに対するマッピング)は, この文書の範囲外だ.

source: If this is a server-side SSH session and this is not the first message received over the session, then the tmSecurityName is set to the previously established tmSecurityName for the session (the value from step B, determined from a previous incoming message).
ja: サーバ側のSSHセッションで, セッションを介して受信したメッセージでなければ, セッションに以前設定した tmSecurityName (ステップ Bからの値で, 以前受信したメッセージから決定されている) に tmSecurityName は設定される.

source: additional call to GSS_Init_sec_context() to process the final reply token.
ja: この状態の時, クライアントは, 最終の応答トークンの処理に, GSS_Init_sec_context() を追加で呼び出す.

source: The security considerations in [RFC4251] apply.
ja: [RFC4251]のセキュリティの考察が適用される.

source: Implementors who decide not to rekey at least once every 2**32 packets should understand these issues.
ja: 2**32パケットごとに少なくとも1度の鍵の再発行をしないと決める実装者は, この問題を理解する必要がある.

source: Security Parameter Passing ................................12 3.3.
ja: セキュリティパラメータの転送 ................................12 3.3.

source: The SSHFP resource record (RR) is used to store a fingerprint of an SSH public host key that is associated with a Domain Name System (DNS) name.
ja: SSHFP リソースレコード (RR) は, DNS名に関連した SSH 公開鍵の指紋を保存するのに用いられる.

source: Implementations SHOULD NOT use revoked certificates because many causes of certificate revocation mean that the critical authentication properties needed are no longer true.
ja: 実装は失効した証明書を利用しないほうがよい. 証明書失効の多くの原因は, 必要とされる重要な認証の性質がもはや真ではないことを意味しているからだ.

source: If the MIC is not valid, the user authentication fails, and the server MUST return SSH_MSG_USERAUTH_FAILURE.
ja: MIC が正当でなければ, ユーザ認証は失敗し, SSH_MSG_USERAUTH_FAILURE をサーバは返さなければならない.

source: Note that unlike an "ssh-rsa" host key, K_T is used only for encryption, and not for signature.
ja: 注意: "ssh-rsa" ホスト鍵と異なり, K_T は暗号化のみに利用される. 署名には利用されない.

source: On the other hand, having no central registration leads to conflicts in method identifiers, making interoperability difficult.
ja: 一方で, 中央での登録がないと方式の識別子に衝突がおきたり相互運用性が困難になってしまう.

source: Connection Protocol Channel Types
ja: コネクションプロトコルのチャンネルのタイプ

source: The SSH_PUBLICKEY_VERSION_NOT_SUPPORTED status code must not be sent in response to any other request.
ja: SSH_PUBLICKEY_VERSION_NOT_SUPPORTED 状態コードは, 他の要求への応答として送られてはならない.

source: Opcodes 1 to 159 have a uint32 argument.
ja: 1 から 159 までのオペコードは, uint32 の引数を1つ持つ.

source: The sequence_number is initialized to zero for the first packet, and is incremented after every packet (regardless of whether encryption or MAC is in use).
ja: sequence_number は, 最初のパケットで 0 に初期化される. そして(暗号化やMACの使用にかかわらず) すべてのパケットごとに増加される.

source: This requires 24 bytes of key data (of which 168 bits are actually used).
ja: 24byteの鍵データを必要とする(このうち 168 bit が実際に用いられる).

source: Algorithm negotiation chooses the public key algorithm to be used for signing and the method name of the key exchange.
ja: アルゴリズムのネゴシエーションでは, 署名に用いる公開鍵アルゴリズムと鍵交換の方法名を選ぶ.

source: See "SNMP Applications" [RFC3413] for further information.
ja: さらなる情報は, "SNMP Applications" [RFC3413] を見よ.

source: In traditional SSH deployments, host keys are normally expected to change infrequently, and there is often no mechanism for validating host keys not already known to the client.
ja: 伝統的なSSHの配置では, ホスト鍵は通常めったに変更されず, クライアントが事前に知らないホスト鍵を検証するためのメカニズムはないことが多い.

source: Base64 encoding is described in Section 6.8 of [MIME].
ja: Base64 エンコーディングは， [MIME] の 6．8節に記述されている．

source: In particular, it is essential that the client use a high-quality cryptographic pseudo-random number generator to generate K. Using a bad random number generator will allow an attacker to break all the encryption and integrity protection of the Secure Shell transport layer.
ja: 特に, クライアントが高品質の暗号学的議事乱数生成器を K の生成に用いることは不可欠だ. 悪い乱数生成器を用いると, セキュアシェルトランスポート層の暗号化と完全性の保護のすべてを攻撃者が破ることができるようになる.

source: Possible mechanisms are discussed in Section 4.1 and may also include secured Web pages, physical pieces of paper,
ja: 可能は仕組みは, 4.1 節で議論されている. 安全なWebページや, 物理的な紙片などの方法がある.

source: Since ECDH and ECMQV allow for elliptic curves of arbitrary sizes and thus arbitrary security strength, it is important that the size of elliptic curve be chosen to match the security strength of other elements of the SSH handshake.
ja: ECDHとECMQVは, 任意の楕円曲線サイズ, つまり任意のセキュリティ強度を許すので, SSHハンドシェイクの他の要素のセキュリティ強度に一致する楕円曲線のサイズを選ぶことが重要だ.

source: If no default exists, 500 ms can be used as the BREAK length.
ja: デフォルトがなければ, 500msが BREAK の長さとして用いられる.

source: This document describes a method for invoking and running the Network Configuration Protocol (NETCONF) within a Secure Shell (SSH) session as an SSH subsystem.
ja: この文書は, セキュアシェル (SSH)のサブシステムとして SSH のセッション内で Network Configuration Protocol (NETCONF) を呼び出し実行する方法を記述する.

source: Table 3.
ja: 表 3.

source: This prefix may be used by Security Models or other components to identify which secure transport infrastructure authenticated a securityName." ::= { snmpDomains 7 }
ja: この接頭辞は, どの安全なトランスポート基盤が securityName を認証したかを識別するために Security Model や 他のコンポーネントから用いられる. ::= { snmpDomains 7 }

source: This method requires no centrally administered infrastructure, and no
ja: この方法は, 中央の管理されたインフラや第三者の調停が不要だ.

source: Naming Conventions ........................................22 7.2.
ja: 命名規則 ........................................22 7.2.

source: As noted in Section 9, it may be desirable under site security policy to obscure information about the precise nature of the error; thus, it is RECOMMENDED that implementations provide a method to suppress these messages as a matter of policy.
ja: 9節で述べるように, エラーの詳細な性質の情報は隠したほうがサイトのセキュリティポリシー上望ましいかもしれない; つまり, ポリシーの問題としてこれらのメッセージを抑制する方法を実装が提供することが望ましい.

source: Additionally, if not rekeyed frequently enough, the SSH Transport Protocol may leak information about payload data.
ja: また, 十分に鍵の再発行が行なわれないと, SSH トランスポートプロトコルは ペイロードデータの情報を漏らしてしまうかもしれない.

source: This is a block cipher with 8-byte blocks.
ja: これは, 8byteブロックのブロック暗号だ.

source: The per-session state that is referenced by tmStateReference may be saved across multiple messages in a Local Configuration Datastore.
ja: tmStateReference で参照されるセッションごとの状態は, ローカル設定データストア (Local Configuration Datastore) に複数のメッセージにまたがって保存されるかもしれない.

source: Client implementors SHOULD provide a configurable policy used to select the order of methods used to verify a host key.
ja: クライアントの実装者は, ホスト鍵の検証法の順番を選択する設定可能なポリシーを提供する必要がある.

source: If no BREAK was preformed, SSH_MSG_CHANNEL_FAILURE MUST be sent.
ja: BREAK が実行されなかったら, SSH_MSG_CHANNEL_FAILURE が送られなければならない.

source: Using NETCONF over SSH
ja: SSH 上での NETCONF の利用

source: If the server presents names or prompts longer than 30 characters, the client MAY truncate these fields to the length it can display.
ja: サーバが30文字を越える name や prompt を提供したなら, クライアントは これらのフィールドを表示できる長さに切り詰めてもよい.

source: Section 6.3 of [RFC4253] requires that the packet length, padding length, payload, and padding fields of each binary packet be encrypted.
ja: [RFC4253] の 6.3 節は, それぞれのパケットをの packet length と padding length, payload, and padding fields を暗号化するよう要求している.

source: For example, the method name for ECDH key exchange with ephemeral keys generated on the nistp256 curve is "ecdsa-sha2-nistp256".
ja: たとえば, nistp256 曲線から生成された一時鍵を用いるECDHの方法の名前は, "ecdsa-sha2-nistp256" だ.

source: For example, it has been shown that traffic analysis of an SSH session can yield information about the length of the password - [Openwall] and [USENIX].
ja: たとえば, SSHのセッションのトラフィック解析によりパスワードの長さの情報が得られることが示されている. - [Openwall] と [USENIX] を参照.

source: IANA Considerations ............................................24 9.
ja: IANA の考慮 ............................................24 9.

source: If the user authentication is unsuccessful, then the transport connection is closed, the snmpSshtmSessionUserAuthFailures counter is incremented, an error indication is returned to the calling module, and processing stops for this message.
ja: ユーザ認証が失敗したら, トランスポート接続は閉じられ, snmpSshtmSessionUserAuthFailures カウンタがインクリメントされ, エラー表示が呼び出し元モジュールに返されて, このメッセージに対する処理が停止する.

source: It should be noted that these names resemble STD 11 [RFC0822] email addresses.
ja: この名前が, STD 11 [RFC0822]のメールアドレスと似ていることを明記しておく.

source: Using DNS to Securely Publish Secure Shell (SSH) Key Fingerprints
ja: DNSを利用したセキュア シェル (SSH) の鍵の指紋の安全な配布

source: This document freely uses terminology and notation from both documents without reference or further explanation.
ja: この文書は, 参照や説明なしに2つの文書から用語や表記法を自由に利用する.

source: However, implementers should be aware of security considerations specific to the use of X.509v3 certificates in a public key infrastructure, including considerations related to expired certificates and certificate revocation lists.
ja: しかし, 期限切れの証明書や証明書失効リストに関連する考察を含む, 公開鍵基盤での X.509v3 証明書の利用に特有のセキュリティの考察に実装者は注意しなければならない.

source: The REQUIRED and RECOMMENDED curves in this document are at present believed to offer security at the levels indicated in this section and as specified with the table in Section 1.
ja: この文書での必須/推奨の曲線は, この節で示しまた1節の表で指定されたレベルのセキュリティを提供すると現時点では考えられている.

source: It allows the SSH server to propose new groups on which to perform the Diffie-Hellman key exchange to the client.
ja: SSHのサーバとクライアントが Diffie-Hellman 鍵交換をするための新しい群を提案します.

source: In the compatibility mode, the server SHOULD NOT send any further data after sending its identification string until it has received an identification string from the client.
ja: この互換モードでは, クライアントからの識別文字列を受信するまではサーバはサーバの識別文字列を送ったあとでデータを送らないほうがよい.

source: The label <cipher>-ctr indicates that the block cipher <cipher> is to be used in "stateful-decryption counter" (SDCTR) mode.
ja: ラベル <cipher>-ctr は, ブロック暗号 <cipher> を "stateful-decryption counter" (SDCTR) モードで利用することを示している.

source: This allows communication without prior communication of host keys or certification.
ja: この選択肢を利用すると, あらかじめホスト鍵や信用についてやりとりせずに通信できる.

source: User Authentication ............................................10 5.1.
ja: ユーザ認証 ............................................10 5.1.

source: Protocol Version Exchange
ja: プロトコルバージョンのやりとり

source: The conventions and instructions to the IANA for future assignments are given in this section.
ja: この節には, 規約と, 将来の割り当てについてのIANAへの指示がある.

source: The following opcode values have been defined.
ja: 以下の opcode 値が定義されている.

source: This document describes a general purpose authentication method for the SSH authentication protocol.
ja: この文書は, SSH認証プロトコルのための汎用の認証法を記述している.

source: Clients that do validate the DNSSEC signatures themselves SHOULD use standard DNSSEC validation procedures.
ja: DNSECの署名を自ら検証するクライアントは, 標準の DNSSEC 検証手続きを使う必要がある.

source: The Secure Shell Transport Model provides protection against the threats identified by the RFC 3411 architecture [RFC3411]:
ja: セキュアシェルトランスポートモデルは, RFC3411 アーキテクチャ [RFC3411] で確認された脅威に対する保護を提供する:

source: Password authentication uses the following packets.
ja: パスワード認証は次のパケットを利用する.

source: The same hash algorithm MUST be used in key derivation.
ja: 鍵の導出にも同じハッシュアルゴリズムが用いられなければならない.

source: Implementations should treat these names as opaque identifiers and should not assume any relationship between the groups used by SSH and the groups defined for IKE.
ja: 実装は, これらの名前を内部識別子として扱わなければならない. また, SSHが用いる群とIKEで定義された群との間の関係を仮定してはならない.

source: If X=(2**L)-1, then "increment X" has the traditional semantics of "set X to 0." We use the notation <X> to mean "convert X to an L-bit string in network- byte-order." Naturally, implementations may differ in how the internal value X is stored.
ja: X=(2**L)-1 のとき, "increment X" は "set X to 0" という伝統的な意味を持つ. 表記 <X> を "XをL-bitのネットワークバイトオーダー文字列に変換する" という意味で用いる. 当然, 実装は, 内部的な値であるXを保持する方法で別の表現をしてもよい.

source: Signature Encoding ..................................5 4.
ja: 署名のエンコーディング ..................................5 4.

source: The goal of secure shell is to establish two secure tunnels between a client and a server, one tunnel carrying client-to-server communications and the other carrying server-to-client communications.
ja: セキュアシェルの目標は, クライアントとサーバの間に2つの安全なトンネルを確立することだ. 1つのトンネルは, クアイアントからサーバへの通信を運び, もう1つはサーバからクライアントへの通信を運ぶ.

source: IANA assigned a TCP port number that is the default port for NETCONF over SSH sessions as defined in this document.
ja: IANA は, この文書で定義する SSH セッション上の NETCONF のデフォルトポートとして TCP ポート番号を割り当てる.

source: Except for one HISTORIC algorithm generally regarded as obsolete, this document does not define any new protocols or number ranges not already defined in: [SSH-ARCH], [SSH-TRANS], [SSH-USERAUTH], [SSH-CONNECT].
ja: 一般に時代遅れとみなされている1つの歴史的なアルゴリズムを除いて, この文書は,[SSH-ARCH], [SSH-TRANS], [SSH-USERAUTH], [SSH-CONNECT] で定義されていない新しいプロトコルや番号の範囲を定義していない.

source: The defined algorithm names are listed in Section 6.3.
ja: 定義済みのアルゴリズム名は, 6.3 節に挙げられている.

source: It is RECOMMENDED that all MIB documents using this Textual Convention make explicit any limitations on index component lengths that management software must observe.
ja: このテキスト表記を用いる MIB 文書は, 管理ソフトウェアが遵守しなければならないインデックスコンポーネントの制限を明示的に行なうことを推奨する.

source: It is also RECOMMENDED that a message expressing this concern be presented to the administrator of a system when the action is taken to enable debugging messages.
ja: さらに, デバッグメッセージを有効にする作業が行なわれた場合に, この懸念を表明するメッセージがシステムの管理者に提示されることが推奨される.

source: Transport .................................................14 9.3.1.
ja: トランスポート .............................................14 9.3.1.

source: Have SSH close the session associated with tmSessionID.
ja: tmSessionID に関連するセッションを SSH に終了させる.

source: Doing so requires normalization.
ja: このために正規化が必要だ.

source: The ecdsa_signature_blob value has the following specific encoding:
ja: ecdsa_signature_blob の値は, 次のエンコーディングを持つ:

source: If the server has been compromised, using password authentication will reveal a valid username/password combination to the attacker, which may lead to further compromises.
ja: サーバが侵害されている時にパスワード認証を利用すると, 攻撃者に正当なユーザ名とパスワードの組合せを示してしまう. これはさらなる侵害を生むかもしれない.

source: The identity of the server MUST be verified and authenticated by the client according to local policy before password-based authentication data or any configuration or state data is sent to or received from the server.
ja: サーバの識別情報は, パスワードベースの認証データや設定や状態のデータをサーバに送ったりサーバから受け取ったりする前に, ローカルなポリシーに基づいてクライアントが検証し認証されなければならない.

source: The major goal of this method is to allow the SSH client to have little or no knowledge of
ja: この方法の主な目的は, SSH サーバが使う認証メカニズムの仕様を(ほとんどないしまったく)SSHクライアントが知らなくてもよいようにすることだ.

source: This port number has been registered with the IANA, and has been officially assigned for SSH.
ja: このポート番号は IANA によって登録されている. また, SSHに対して正式に割り当てられている.

source: The SSH protocol consists of three major components: The Transport Layer Protocol provides server authentication, confidentiality, and integrity with perfect forward secrecy.
ja: SSH プロトコルは, 3つの主要な要素から構成されている: トランスポート層プロトコルは サーバの認証や, 機密性, 申し分なく転送を秘密にする完全性を提供する.

source: However, implementations SHOULD check that the packet length is reasonable in order for the implementation to avoid denial of service and/or buffer overflow attacks.
ja: しかし, 実装は, DoS攻撃やバッファオーバーフロー攻撃を避けるためにパケットの長さが合理的かチェックする必要がある.

source: If a new packet is added to the stream every time the attacker knows the IV that is supposed to be used for the next packet, then the attacker will not be able to guess the correct IV, thus the attack will never be successful.
ja: 新しいパケットがストリームに追加されるたびに, 攻撃者は次のパケットに利用されるであろうIVを知る. それゆえ, 攻撃者が正しいIVを推測できなければ攻撃はけっして成功しない.

source: Connection Protocol Global Request Names ...........14 4.9.3.
ja: コネクションプロトコルのグローバルなリクエスト名.....14 4.9.3.

source: The document containing the <hello> element MUST be the first XML document that the client sends after the NETCONF session is established.
ja: <hello> 要素を含む文書は, NETCONF セッションが確立したあとにクライアントが送る最初の XML 文書でなければならない.

source: It performs server host authentication, key exchange, encryption, and integrity protection.
ja: サーバの認証, 鍵の交換, 暗号化, 完全性の保護を行なう.

source: See Appendix A for a proof that the encoding of K is always short enough to be thus encrypted.
ja: K のエンコーディングが暗号化する上で常に十分短い長さになることの証明が付録 A にある.

source: Signals
ja: シグナル

source: This violates the requirements of [RFC4253].
ja: これは [RFC4253] の要件に違反している.

source: This document defines how NETCONF can be used within a Secure Shell (SSH) session, using the SSH connection protocol [RFC4254] over the SSH transport protocol [RFC4253].
ja: この文書は, SSH トランスポートプロトコル [RFC4253] 上のSSH コネクションプロトコル [RFC4254] を用いてセキュアシェル (SSH) のセッション中で NETCONFをどのように利用できるかを定義する.

source: This will allow NETCONF over SSH traffic to be easily identified and filtered by firewalls and other network nodes.
ja: これは, SSH トラフィック上の NETCONF を, ファイアウォールや他のネットワークノードで容易の識別しフィルタするのを可能にする.

source: For example, National Institute of Standards and Technology's (NIST's) draft recommendations on cryptographic algorithms and key lengths [SP-800-131] specify that digital signature generation using an RSA key with modulus less than 2048 bits or with the SHA-1 hash function is acceptable through 2010 and deprecated from 2011 through 2013, whereas an RSA key with modulus at least 2048 bits and SHA-256 is acceptable for the indefinite future.
ja: 例えば, National Institute of Standards and Technology (NIST) の暗号アルゴリズムと鍵長の勧告案 [SP-800-131] は, 2048 ビットよりも小さいモジュラスを持つ RSA 鍵や SHA-1 ハッシュ関数を用いる RSA 鍵を用いた電子署名生成は, 2010 年まで受け入れられ 2011年から2013年まで非推奨と指定している. 一方, 少なくとも 2048 ビットのモジュラスを持ち SHA-256 を用いる RSA 鍵は, 無期限で受け入れられる.

source: For channel requests, replies that relate to the same channel MUST also be replied to in the right order.
ja: チャンネルの要求でも, 同じチャンネルに関係する応答は正しい順番でなされなければならない.

source: Furthermore, it is expected that some organizations will want to use their own algorithms or methods.
ja: さらに, いくつかの組織が自身のアルゴリズムや方式を使いたいと求めることが予想される.

source: The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this document are to be interpreted as described in RFC 2119 [3].
ja: この文書でのキーワード "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", "OPTIONAL" は, RFC 2119 [3] で記述されているように解釈される.

source: [RFC5759] provides additional guidance for ECDSA keys in Suite B X.509v3 certificate and certificate revocation list profiles.
ja: [RFC5759] は, Suite B X.509v3 証明書での ECDSA と証明書失効リストプロファイルに対して追加のガイダンスを提供している.

source: Otherwise, the server responds with:
ja: そうでなければ, サーバは以下で応答する:

source: If the above steps failed to select a session to use, then call openSession() with the tmStateReference as a parameter.
ja: 利用するセッションを選ぶ上記のステップが失敗したら, tmStateReference をパラメータとする openSession() を呼ぶ.

source: The "none" algorithm specifies that no encryption is to be done.
ja: "none" アルゴリズムは, 暗号化が行なわれないことを指定する.

source: * If the resulting major_status code is GSS_S_CONTINUE_NEEDED, then the output token is sent to C, and processing continues with step 2.
ja: * 結果の major_status コードが GSS_S_CONTINUE_NEEDED なら, Cに output トークンを送って, ステップ2から処理が続けられる.

source: SSH Host Key Verification .......................................2 2.1.
ja: SSH ホスト鍵の検証 .......................................2 2.1.

source: Additionally, another CBC mode attack may be mitigated through the insertion of packets containing SSH_MSG_IGNORE.
ja: さらに, SSH_MSG_IGNORE を含むパケットを挿入することで, 別種のCBCモードへの攻撃は和らげられる.

source: It is RECOMMENDED that the 'x11 authentication cookie' that is sent be a fake, random cookie, and that the cookie be checked and replaced by the real cookie when a connection request is received.
ja: 送られる 'x11 authentication cookie' は, にせ物のランダムなクッキーで, 接続要求が受け入れられた際にそのクッキーをチェックし置き換えることが推奨される.

source: It is important to employ only safe primes as moduli, as they allow us to find a generator g so that the order of the generated subgroup does not factor into small primes, that is, with p = 2q + 1, the order has to be either q or p - 1.
ja: 法として安全な素数だけを採用することは重要だ. そうすることで小さい素数に因数分解できないオーダーを持つ部分群を生成する生成器 g を見つけられる. つまり, p = 2q + 1 で, オーダーは q か p -1 のどちらかになる.

source: A key exchange method uses explicit server authentication if the key exchange messages include a signature or other proof of the server's authenticity.
ja: 鍵交換のメッセージが署名やサーバの信頼性を証明するなにかを含んでいるなら, 鍵交換法は明示的なサーバ認証を用いる.

source: SSH User and Key Selection
ja: SSH のユーザと鍵の選択

source: The Telnet protocol furnishes a means to send a "BREAK" signal, which RFC 854 [1] defines as "a signal outside the USASCII set which is currently given local meaning within many systems".
ja: Telnet プロトコルは, "BREAK" 信号を送る方法を提供している. RFC 854[1]で以下のように定義している "多くのシステムで現在ローカルな意味を与えられているUSASCIIの集合の外部にある信号".

source: is needed (i.e., because there are multiple underlying authentication mechanisms that must be used to authenticate the user).
ja: (つまり, ユーザを認証するのに使われなければならない基盤となる認証メカニズムが複数ある場合だ).

source: This document requires that SSH servers default to allowing access to the "netconf" SSH subsystem only when using a specific TCP port assigned by IANA for this purpose.
ja: この文書は, この目的のために IANA に割り当てられた特定の TCP ポートのみで "netconf" SSH サブシステムへのアクセスを許すのをデフォルトとするよう SSH サーバに要求する.

source: Fixed length data is sometimes represented as an array of bytes, written byte[n], where n is the number of bytes in the array.
ja: 固定長のデータは, byteの配列として表現されることがある. このとき, byte[n]と表記される. n は配列中のbyteの数だ

source: Using the NETCONF Protocol over Secure Shell (SSH)
ja: セキュアシェル (SSH) 上での NETCONF プロトコルの利用

source: Both parties MAY ignore all extra data sent after the allowed window is empty.
ja: 許される window が空になったあとで転送されたすべての余分なデータは, どちらの側も無視してもよい.

source: The Elliptic Curve Diffie-Hellman (ECDH) key exchange method generates a shared secret from an ephemeral local elliptic curve private key and ephemeral remote elliptic curve public key.
ja: 楕円曲線 Diffie-Hellman (ECDH) 鍵交換法は, 一時的でローカルな楕円曲線秘密鍵と一時的でリモートの楕円曲線公開鍵から共有の秘密(shared secret)を生成する.

source: Applications that require a longer BREAK may choose to ignore this suggestion.
ja: より長い BREAKを必要とするアプリケーションは, この示唆を無視してもよい.

source: The value of the comment attribute contains user-specified text about the public key.
ja: comment 属性の値は, 公開鍵についてユーザが指定したテキストだ.

source: If the same RSA key is used for multiple SSH connections, an attacker who can find the private key (either by factorising the public key or by other means) will gain access to all of the sessions that used that key.
ja: 複数の SSH 接続で 同じ RSA 鍵を用いると, (公開鍵の素因数分解やその他の方法で)秘密鍵を見つけることができる攻撃者がその鍵を用いるセッションのすべてにアクセスできる.

source: Due to the format of secure shell binary packets, the buffer sizes needed to implement AEAD_AES_256_GCM are smaller than those required in [RFC5116].
ja: セキュアシェルのバイナリパケットの形式のために, AEAD_AES_256_GCM を実装するのに必要なバッファサイズは [RFC5116] で要求されているものよりも小さい.

source: As such, an example of a valid identification string is
ja: 正しい識別文字列の例は以下だ.

source: Terminating null characters are not used.
ja: null 文字による終端は行なわない.

source: S generates a random number y (0 < y < q) and computes f = g^y mod p.
ja: S は乱数 y (0 < y < q) を生成し f = g^y mod p を計算する.

source: The format of public key blobs are detailed in Section 6.6, "Public Key Algorithms" of the SSH Transport Protocol document [2].
ja: 公開鍵ブロブの形式は SSH トランスポートプロトコル文書 [2] の 6.6 節 「公開鍵アルゴリズム」 に詳述されている.

source: The user's public key is sent to the server using an SSH_MSG_USERAUTH_REQUEST message.
ja: ユーザの公開鍵は, SSH_MSG_USERAUTH_REQUEST メッセージを用いてサーバに送られる.

source: Once the SSH session has been established, the NETCONF client will invoke NETCONF as an SSH subsystem called "netconf".
ja: SSHのセッションが確立したら, NETCONF クライアントは, "netconf" SSHサブシステムとして NETCONF を起動する.

source: It MUST NOT include this method if the initial key exchange was not performed using a GSS-API-based key exchange method defined in accordance with Section 2.
ja: 2 節に従って定義された GSS-API ベースの鍵交換法を用いずに最初の鍵交換が行なわれたら, この認証法をサーバは含めてはならない.
